:PROPERTIES:
:ID:       da888d96-a444-49f7-865f-7b122c15b14e
:END:
#+TITLE: Desktop
#+AUTHOR:    David Conner
#+EMAIL:     noreply@te.xel.io
#+DESCRIPTION: Desktop Tools/Utilities

***** Systemd Env

+ Elephant can load =.env= files in the configuration directories it searches, so
  that processes it spawns will have a consistent =uwsm= environment.
+ Another option: fix this in =sysstemd.user.extraConfig= by overriding what
  =programs.hyprland.systemd.setPath.enable= would otherwise set, which is
  probably not where you want to set it

#+begin_src shell
DefaultEnvironment="PATH=/run/wrappers/bin:/etc/profiles/per-user/%u/bin:/nix/var/nix/profiles/default/bin:/run/current-system/sw/bin:\$PATH"
echo $DefaultEnvironment | tr ':' '\n'
#+end_src

#+RESULTS:
| PATH=/run/wrappers/bin            |
| /etc/profiles/per-user/%u/bin     |
| /nix/var/nix/profiles/default/bin |
| /run/current-system/sw/bin        |
| $PATH                             |
